load_test/load_test_backend.yaml
# usage: artillery run --variables '{ "authToken": <<JWT_TOKEN>> }' load_test_backend.yaml

config:
  target: "https://i7afcdbeif.execute-api.eu-central-1.amazonaws.com"
  phases:
    - duration: 60
      arrivalRate: 1
      rampTo: 5
      name: Warm up phase
    - duration: 120
      arrivalRate: 50
      name: Spike phase
  defaults:
    headers:
      Authorization: "Bearer {{ authToken }}"

scenarios:
  - flow:
      - get:
          url: "/prod/student?func=get_student_course_names&UserId=9e1f6340-65ea-42e6-99a3-98a2b16f14be"